# p07. 데이터 정제 및 준비

## 데이터 분석 프로세스
## 주제 선정 - 데이터 수집 - 데이터 처리( 데이터획득, 처리, 시각화 ) - 데이터 분석 - 정보 도출

In [124]:
import numpy as np
import pandas as pd

## 1. Missing Data(결측치 = NA(Not Available), NaN(Not a Number))

## 결측치 처리방법 : 무시 , 제거(dropna) , 바꾸기

In [5]:
#Series
string_data=pd.Series(["aaaardvark","artichoke",np.nan,'avocado'])
string_data

0    aaaardvark
1     artichoke
2           NaN
3       avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## (1) 누락된 데이터 제거 dropna()

In [13]:
from numpy import nan as NA
data=pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
#DataFrame
data=pd.DataFrame([[1.,6.5,3.],[1,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
# NA가 하나라도 포함하고 있으면 모두 제거 
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna(axis=1,how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data.dropna(axis=0,how="all")

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [38]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  1.254499       NaN       NaN
1  0.407666       NaN       NaN
2  0.611293       NaN  0.749424
3 -0.438194       NaN -0.590219
4 -0.742329 -1.704893 -0.003005
5 -0.673347 -0.067279  0.238827
6 -0.657797 -0.270101 -0.209958

In [40]:
df.dropna()

          0         1         2
4 -0.742329 -1.704893 -0.003005
5 -0.673347 -0.067279  0.238827
6 -0.657797 -0.270101 -0.209958

In [42]:
df.dropna(thresh=2) #2개의 값이 있는 경우만 제거

          0         1         2
2  0.611293       NaN  0.749424
3 -0.438194       NaN -0.590219
4 -0.742329 -1.704893 -0.003005
5 -0.673347 -0.067279  0.238827
6 -0.657797 -0.270101 -0.209958

## (2) 결측값 채우기 fillna()

In [44]:
df.fillna(0)

          0         1         2
0  1.254499  0.000000  0.000000
1  0.407666  0.000000  0.000000
2  0.611293  0.000000  0.749424
3 -0.438194  0.000000 -0.590219
4 -0.742329 -1.704893 -0.003005
5 -0.673347 -0.067279  0.238827
6 -0.657797 -0.270101 -0.209958

In [46]:
#dict
df.fillna({1:0.5,2:0})

          0         1         2
0  1.254499  0.500000  0.000000
1  0.407666  0.500000  0.000000
2  0.611293  0.500000  0.749424
3 -0.438194  0.500000 -0.590219
4 -0.742329 -1.704893 -0.003005
5 -0.673347 -0.067279  0.238827
6 -0.657797 -0.270101 -0.209958

In [49]:
#inplace=True : 또다른 객체를 반환하지않고, 기존 객체를 수정해서 사용
_=df.fillna(0,inplace=True)
df

          0         1         2
0  1.254499  0.000000  0.000000
1  0.407666  0.000000  0.000000
2  0.611293  0.000000  0.749424
3 -0.438194  0.000000 -0.590219
4 -0.742329 -1.704893 -0.003005
5 -0.673347 -0.067279  0.238827
6 -0.657797 -0.270101 -0.209958

In [69]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0  0.158084 -0.287457 -0.528674
1  0.658695 -1.029171 -1.913136
2 -0.271169       NaN -0.334531
3 -0.704780       NaN  1.361560
4 -1.301966       NaN       NaN
5 -0.151682       NaN       NaN

In [74]:
df.fillna(method='ffill') #f:front b:back (앞뒤값을 채우기)

df

          0         1         2
0  0.158084 -0.287457 -0.528674
1  0.658695 -1.029171 -1.913136
2 -0.271169       NaN -0.334531
3 -0.704780       NaN  1.361560
4 -1.301966       NaN       NaN
5 -0.151682       NaN       NaN

In [75]:
df.fillna(method='ffill',limit=2) #limit=2 : 2개까지만 앞뒤값으로 채우기

          0         1         2
0  0.158084 -0.287457 -0.528674
1  0.658695 -1.029171 -1.913136
2 -0.271169 -1.029171 -0.334531
3 -0.704780 -1.029171  1.361560
4 -1.301966       NaN  1.361560
5 -0.151682       NaN  1.361560

In [81]:
data=pd.Series([1,NA,3.5,7])
data

data.fillna(data.mean()) #결측치를 중간값으로 채우기

0    1.000000
1    3.833333
2    3.500000
3    7.000000
dtype: float64

## 2. 데이터 변형

### (1) 중복 제거

In [224]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [225]:
data.duplicated() #중복여부

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [226]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### 새로운 컬럼(v1) 만들고, k1 컬럼 중복 제거

In [230]:
data['v1']=range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [231]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [105]:
# 함수나 매핑을 이용해서 데이터 변형하기 : map()
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Pastrami','corned bacon'],'ounces':[4,3,12,6,7.5,8,3]})

data

           food  ounces
0         bacon     4.0
1   pulled pork     3.0
2         bacon    12.0
3      Pastrami     6.0
4   corned beef     7.5
5      Pastrami     8.0
6  corned bacon     3.0

In [109]:
meat_to_animal={'bacon':'pig','pastrami':'pig','pulled pork':'pig','corned beef':'cow','corned bacon':'pig'
               
}
lowercased=data['food'].str.lower()
lowercased

0           bacon
1     pulled pork
2           bacon
3        pastrami
4     corned beef
5        pastrami
6    corned bacon
Name: food, dtype: object

In [110]:
data['animal']=lowercased.map(meat_to_animal)

data

           food  ounces animal
0         bacon     4.0    pig
1   pulled pork     3.0    pig
2         bacon    12.0    pig
3      Pastrami     6.0    pig
4   corned beef     7.5    cow
5      Pastrami     8.0    pig
6  corned bacon     3.0    pig

In [113]:
data['food'].map(lambda x:meat_to_animal[x.lower()])
data

           food  ounces animal
0         bacon     4.0    pig
1   pulled pork     3.0    pig
2         bacon    12.0    pig
3      Pastrami     6.0    pig
4   corned beef     7.5    cow
5      Pastrami     8.0    pig
6  corned bacon     3.0    pig

In [126]:
## 값 치환하기 (=replace 281)
data=pd.Series([1.,-999.,02.,-999.,-1000,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [129]:
data.replace({-999:np.nan,-1000:0})
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

## 축 색인 이름바꾸기  283

In [178]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio','Colorado','New York'],
                    columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [181]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [184]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [185]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

## 개별화 & 양자화 284

In [187]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [190]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [192]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [194]:
bins=[18,25,35,60,100]
bins

[18, 25, 35, 60, 100]

In [197]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [202]:
cats.codes

cats.categories

pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

## 3.이상치(=outlier):특잇값 288

### np.random.randn(1000,4):평균 0, 표준편차 2인 가우시안 표준 정규분포 난수 배열생성
### np.random.rand(m,n): 0 ~ 1 의 균일 정규분포 난수 배열 생성

In [135]:
data=pd.DataFrame(np.random.randn(1000,4))
data.head()

          0         1         2         3
0 -0.373227  1.042292  0.033521  0.619785
1  0.047501 -0.714661 -1.135366  0.232469
2  1.862255 -0.681276 -1.718652 -0.933103
3 -0.056181  1.080058  1.242226 -0.723478
4 -1.046734  1.590745 -0.716731  0.206769

In [137]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016854     0.041638     0.043058    -0.002690
std       0.984999     1.045759     1.004183     1.028558
min      -2.923317    -2.918420    -3.585661    -3.301371
25%      -0.641694    -0.715829    -0.618315    -0.736843
50%       0.022227     0.034590     0.054091    -0.005915
75%       0.654876     0.737934     0.738085     0.677677
max       2.624746     3.677288     3.313510     3.309681

In [139]:
col=data[2]

In [145]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
202  1.477128 -0.605570  0.502612  3.138453
361  0.877161  0.849506  0.045820 -3.301371
418 -1.013094 -0.285909  3.055011  0.202505
471  0.494674  1.120833 -0.742456  3.309681
476  0.175062 -0.140530  3.313510 -1.483700
529  0.974171  3.251342  0.634272  1.222880
666 -0.636614 -0.164266  0.356284  3.199144
703 -0.384645  1.750563 -3.042740  1.122244
867  1.602293  3.677288 -0.795948  0.388452
880 -1.956159 -2.108112 -3.585661 -0.313758

In [149]:
data[np.abs(data)>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016854     0.040709     0.043318    -0.003036
std       0.984999     1.042875     1.000963     1.025664
min      -2.923317    -2.918420    -3.000000    -3.000000
25%      -0.641694    -0.715829    -0.618315    -0.736843
50%       0.022227     0.034590     0.054091    -0.005915
75%       0.654876     0.737934     0.738085     0.677677
max       2.624746     3.000000     3.000000     3.000000

In [151]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1  1.0 -1.0 -1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0  1.0 -1.0  1.0

## 치환과 임의 샘플링 289

In [205]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([4, 3, 2, 0, 1])

In [207]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [208]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [209]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [212]:
choices=pd.Series([5,7,-1,6,4])
draws=choices.sample(n=10,replace=True)
draws

4    4
3    6
2   -1
3    6
0    5
2   -1
4    4
2   -1
3    6
4    4
dtype: int64

## 표시자/더미 변수 계산하기 291

In [214]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [216]:
dummies = pd.get_dummies(df['key'],prefix='key')
df_with_dummy=df[['data1']].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [220]:
mnames=['movie_id','title','genres']
movies=pd.read_table('datasets/movielens/movies.dat',sep='::',header=None,names=mnames)
movies[:10]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

## 4. 문자열 다루기

In [154]:
val='a,b,guido'
val.split(',')

['a', 'b', 'guido']

In [156]:
pieces=[x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [158]:
'::'.join(pieces)

'a::b::guido'

## Regular Expression(정규표현식) 298

In [165]:
import re

text= 'foo bar\t baz \tqux'

re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [168]:
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [170]:
regex.findall(text)

[' ', '\t ', ' \t']